Tekla Open API Reference for Tekla Structures 2025
Weld.Insert Method
 NOT YET IMPLEMENTED. Welding lines that refer to welds in the model database appear in views when drawing views are created/updated.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Insert()
Public Overrides Function Insert As Boolean
Return Value
Type: Boolean
False.
See Also
Reference
Weld Class
Tekla.Structures.Drawing Namespace